Rokasbarasa1/STM32-Quadcopter/src/main.c
// If REFRESH_RATE_HZ >= 500 HZ then the control loop will handle the bdshot600 sending
// else the interrupt on timer 3 will handle it
uint8_t manual_bdshot = 0;

// Used by the bdshot600 protocol for all the motors
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim){
    if(htim->Instance == TIM3){
        interrupt = DWT->CYCCNT;
        bdshot600_dma_send_all_motor_data();
        interrupt_end = DWT->CYCCNT;
    }
}

// Handlers for dma bdshot600 pins
// Without the handlers the DMA will crash the system
void DMA2_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BL));
}

void DMA2_Stream4_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BR));
}

void DMA1_Stream6_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FL));
}

void DMA1_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FR));
}

// ------------------------------------------------------------------------------------------------------ Sensor calibrations

// Convert readings from this site to same units nanoTeslas to microteslas
// https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
// When calculating this remember that these values are already
// correcting and that the axis of the magnetometer are switched.

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2

// motor 2807

// Magnetometer
float magnetometer_hard_iron_correction[3] = {
    3277.643241,3275.471406,3270.580735
};

float magnetometer_soft_iron_correction[3][3] = {
    {1.044799,-0.001562,-0.011315},
    {-0.001562,1.025571,0.056894},
    {-0.011315,0.056894,1.107441}
};


// Accelerometer
float accelerometer_correction[3] = {
    -0.022429, -0.334548, 0.952135
};

float accelerometer_scale_factor_correction[3][3] = {
    {1.007638,0.034535,0.012508},
    {0.034535,0.951928,-0.307391},
    {0.012508,-0.307391,0.969725}
};

// Gyro
float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

float base_accelerometer_roll_offset = -2.0;
float base_accelerometer_pitch_offset = 0.0;

float accelerometer_roll_offset = 0;
float accelerometer_pitch_offset = 0;

float yaw_offset = -90.0; // -90 degrees is the default offset as this is to fix the orientation

// ------------------------------------------------------------------------------------------------------ Accelerometer values to degrees conversion
float accelerometer_roll = 0;
float accelerometer_pitch = 0;
float magnetometer_yaw = 0;
float mangetometer_yaw_original = 0.0f; // For comparing
float mangetometer_yaw_low_pass = 0.0f; // For comparing

// ------------------------------------------------------------------------------------------------------ Radio config
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// ------------------------------------------------------------------------------------------------------ PID stuff
struct pid acro_roll_pid;
struct pid acro_pitch_pid;
struct pid acro_yaw_pid;

struct pid angle_pitch_pid;
struct pid angle_roll_pid;

struct pid altitude_hold_pid;

struct pid gps_longitude_pid;
struct pid gps_latitude_pid;

float error_acro_roll = 0;
float error_acro_pitch = 0;
float error_acro_yaw = 0;

float error_angle_pitch = 0;
float error_angle_roll = 0;

float error_throttle = 0;
float error_vertical_velocity = 0;
float error_altitude_barometer = 0;

float error_latitude = 0;
float error_longitude = 0;
float last_error_roll = 0;
float last_error_pitch = 0;


// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.


// Actual PID adjustment for pitch
#define BASE_ANGLE_roll_pitch_MASTER_GAIN 1.0
#define BASE_ANGLE_roll_pitch_GAIN_P 14.0
#define BASE_ANGLE_roll_pitch_GAIN_I 150.0
#define BASE_ANGLE_roll_pitch_GAIN_D 0.0 // Very bad results when used

#define BASE_ACRO_roll_pitch_MASTER_GAIN 1.2
#define BASE_ACRO_roll_pitch_GAIN_P 0.58
#define BASE_ACRO_roll_pitch_GAIN_I 0.0
#define BASE_ACRO_roll_pitch_GAIN_D 0.01

#define BASE_ALTITUDE_HOLD_MASTER_GAIN 1.0
#define BASE_ALTITUDE_HOLD_GAIN_P 0.1 // 1.15
#define BASE_ALTITUDE_HOLD_GAIN_I 0.0 // 0.0010
#define BASE_ALTITUDE_HOLD_GAIN_D 0.0

#define BASE_GPS_HOLD_MASTER_GAIN 1.0
#define BASE_GPS_HOLD_GAIN_P 0.3
#define BASE_GPS_HOLD_GAIN_I 0.0
#define BASE_GPS_HOLD_GAIN_D 0.0

// Used for smooth changes to PID while using remote control. Do not touch this
float angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN;
float angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P;
float angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I;
float angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D;

float added_angle_roll_pitch_master_gain = 0.0f;
float added_angle_roll_pitch_gain_p = 0.0f;
float added_angle_roll_pitch_gain_i = 0.0f;
float added_angle_roll_pitch_gain_d = 0.0f;

float acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN;
float acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P;
float acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I;
float acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D;

float added_acro_roll_pitch_master_gain = 0.0f;
float added_acro_roll_pitch_gain_p = 0.0f;
float added_acro_roll_pitch_gain_i = 0.0f;
float added_acro_roll_pitch_gain_d = 0.0f;

// PID for acro yaw
const float acro_yaw_gain_master = 2.0;
const float acro_yaw_gain_p = 0.45;
const float acro_yaw_gain_i = 0.3;

// PID for altitude control
float altitude_hold_master_gain = BASE_ALTITUDE_HOLD_MASTER_GAIN;
float altitude_hold_gain_p = BASE_ALTITUDE_HOLD_GAIN_P;
float altitude_hold_gain_i = BASE_ALTITUDE_HOLD_GAIN_I;
float altitude_hold_gain_d = BASE_ALTITUDE_HOLD_GAIN_D;

float added_altitude_hold_master_gain = 0.0f;
float added_altitude_hold_gain_p = 0.0f;
float added_altitude_hold_gain_i = 0.0f;
float added_altitude_hold_gain_d = 0.0f;

// PID for gps hold
float gps_hold_master_gain = BASE_GPS_HOLD_MASTER_GAIN;
float gps_hold_gain_p = BASE_GPS_HOLD_GAIN_P;
float gps_hold_gain_i = BASE_GPS_HOLD_GAIN_I;
float gps_hold_gain_d = BASE_GPS_HOLD_GAIN_D;

float added_gps_hold_master_gain = 0.0f;
float added_gps_hold_gain_p = 0.0f;
float added_gps_hold_gain_i = 0.0f;
float added_gps_hold_gain_d = 0.0f;

