Rokasbarasa1/STM32-Quadcopter/src/main.c
// uint8_t moving_average_magetometer_size = 8; // Gives a cutoff of about 9
uint8_t moving_average_magetometer_size = 32; // Gives a cutoff of about 9

struct moving_average moving_average_magnetometer_x;
struct moving_average moving_average_magnetometer_y;
struct moving_average moving_average_magnetometer_z;

float outlier_detection_magnetometer_threshold = 3.0f;
uint8_t outlier_detection_magnetometer_window_size = 10;
struct outlier_detection outlier_detection_magnetometer_x;
struct outlier_detection outlier_detection_magnetometer_y;
struct outlier_detection outlier_detection_magnetometer_z;

float filtering_accelerometer_cutoff_frequency = 15;
struct low_pass_biquad_filter biquad_filter_accelerometer_x;
struct low_pass_biquad_filter biquad_filter_accelerometer_y;
struct low_pass_biquad_filter biquad_filter_accelerometer_z;

struct low_pass_pt1_filter filter_gyro_z;

const float filter_gyro_z_yaw_cutoff_frequency = 50; // 100 Hz was fine also

// Do not go higher in q than 1000
float rpm_notch_filter_q_harmonic_1 = 500;
float rpm_notch_filter_q_harmonic_3 = 200; // Stronger than the 1st harmonic

float rpm_notch_filter_min_frequency = 10; // Hz

struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_0;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_1;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_2;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_3;

struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_0;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_1;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_2;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_3;

// 2nd harmonic is not used as its not visible in the logs

struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_0;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_1;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_2;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_3;

struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_0;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_1;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_2;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_3;
// Z axis is filtered in other way

struct low_pass_biquad_filter roll_d_term_filtering;
struct low_pass_biquad_filter pitch_d_term_filtering;

float gyro_angular_for_d_term[] = {0,0,0};

const float d_term_filtering_min_cutoff = 75;
const float d_term_filtering_max_cutoff = 100;
const uint8_t d_term_filtering_expo = 7;

struct kalman_filter altitude_and_velocity_kalman;

const float altitude_barometer_filtering_min_cutoff = 2;
struct low_pass_biquad_filter altitude_barometer_filtering;

const float gps_filtering_min_cutoff = 3.0f;
// struct low_pass_biquad_filter biquad_filter_gps_lat;
// struct low_pass_biquad_filter biquad_filter_gps_lon;
struct low_pass_pt1_filter biquad_filter_gps_lat;
struct low_pass_pt1_filter biquad_filter_gps_lon;
// ------------------------------------------------------------------------------------------------------ Remote control settings
float max_yaw_attack = 80.0;
float max_roll_attack = 10;
float max_pitch_attack = 10;
float roll_attack_step = 0.2;
float pitch_attack_step = 0.2;
float max_throttle_vertical_velocity = 15; // cm/second

float max_angle_before_motors_off = 40;

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint64_t last_signal_timestamp_microseconds = 0;

// Changing pid chcanges which pid
// 0 - Acro mode
// 1 - angle mode
// 2 - all depending on flight mode set
//      flight mode 0 - acro mode pid
//      flight mode 1 - angle mode pid
//      flight mode 2 - altitude hold pid
//      flight mode 3 - gps hold pid
//      flight mode 4 - gps hild pid

uint8_t pid_change_mode = 2;

// ------------------------------------------------------------------------------------------------------ Logging to SD card
char log_file_base_name[] = "Quad.txt";
char log_file_base_name_gps[] = "QuadGPS.csv";
char log_file_base_name_alt[] = "QuadALT.csv";
char log_file_base_name_mag[] = "QuadMAG.csv";
char log_file_base_name_yaw[] = "QuadYAW.csv";
char log_file_base_name_timing[] = "QuadTIMING.csv";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
char *new_log_file_blackbox_base_name;
uint16_t blackbox_file_index = 0;
// Debug modes
// 0 - motor frequency
// 1 - imu data from drone
// 2 - vertical acceleration data instead of acro mode yaw data
const uint8_t blackbox_debug_mode = 2;
// 0 - acro mode
// 1 - angle mode
const uint8_t blackbox_log_angle_mode_pid = 1;
const uint8_t blackbox_write_repeat_logs_in_same_file = 1;

uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;

// 0 - complex async (faster)
// 1 - simple async
const uint8_t use_simple_async = 0;
const uint8_t use_blackbox_logging = 0;

// 0 - general logging
// 1 - gps logging
// 2 - vertical velocity logging
// 3 - magentometer raw data
// 4 - yaw data
// 5 - timing data
uint8_t txt_logging_mode = 1;


void DMA1_Stream7_IRQHandler(void){
    HAL_DMA_IRQHandler(&hdma_spi3_tx);
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi){
    if (hspi->Instance == SPI3){
        sd_card_set_dma_transfer_call_status(0); // Set to zero as dma is not happening anymore
    }
}

// ------------------------------------------------------------------------------------------------------ Stuff for blackbox logging
uint32_t loop_iteration = 1;
float PID_proportional[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_integral[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_derivative[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_feed_forward[3];
float PID_set_points[6]; // acro roll, acro pitch, acro yaw, throttle, altitude hold outer, altitude hold inner
float remote_control[4];

// ------------------------------------------------------------------------------------------------------ Flight mode settings
// Flight modes:
// (0) - acro
// (1) - angle
// (2) - angle with altitude hold
// (3) - angle with altitude hold and gps hold
// (4) - angle with gps hold and without altitude hold

uint8_t flight_mode = 4;

