Rokasbarasa1/STM32-Quadcopter/src/main.c
uint8_t use_angle_mode = 0;
uint8_t use_vertical_velocity_control = 0;
uint8_t use_gps_hold = 0;


//Logging motor off reason
uint32_t motor_off_index = 0;

int main(void){
    init_STM32_peripherals();
    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;
    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    printf("STARTING PROGRAM\n"); 
    

    
    if(init_drivers() == 0) return 0; // exit if initialization failed

    HAL_Delay(2000); // Dont want to interfere in calibration

    set_flight_mode(flight_mode);
    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    setup_logging_to_sd(0); // If stopped working then re-flash the firmware of the logger and check hardware connection. Check if it works when Li-po connected
    initialize_control_abstractions();
    initialize_motor_communication();
    get_initial_position();

    handle_pre_loop_start();
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;  
    DWT->CYCCNT = 0;                                // Reset the cycle counter
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    while (1){
        // Get current time
        handle_loop_start();
        DWT->CYCCNT = 0;

        radio = DWT->CYCCNT;
        handle_radio_communication();
        post_remote_control_step();
        radio_end = DWT->CYCCNT;

        sensors = DWT->CYCCNT;
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        sensors_end = DWT->CYCCNT;

        motor = DWT->CYCCNT;
        handle_pid_and_motor_control();
        motor_end = DWT->CYCCNT;

        logging = DWT->CYCCNT;
        handle_logging();
        logging_end = DWT->CYCCNT;

        handle_loop_end();

        // printf("ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO,%.2f,%.2f,%.2f;", gyro_angular[0], gyro_angular[1], gyro_angular[2]);
        // printf("MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // if(loop_iteration % 20 == 0){
        //     printf("IMU,%.2f,%.2f,%.2f;", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
        //     printf("\n");
        // }
        
        // printf("2r %lu\n", radio2 - radio);
        // printf("r %lu\n", radio_end - radio);

        // printf("2s %lu\n", sensors2 - sensors);
        // printf("3s %lu\n", sensors3 - sensors2);
        // printf("4s %lu\n", sensors4 - sensors3);
        // printf("5s %lu\n", sensors5 - sensors4);
        // printf("6s %lu\n", sensors6 - sensors5);
        // printf("7s %lu\n", sensors7 - sensors6);
        // printf("8s %lu\n", sensors8 - sensors7);
        // printf("9s %lu\n", sensors9 - sensors8);
        // printf("10s %lu\n", sensors10 - sensors9);
        // printf("11s %lu\n", sensors11 - sensors10);
        // printf("s %lu\n", sensors_end - sensors);

        // printf("2m %lu\n", motor2 - motor);
        // printf("3m %lu\n", motor3 - motor2);
        // printf("4m %lu\n", motor4 - motor3);
        // printf("5m %lu\n", motor5 - motor4);
        // printf("6m %lu\n", motor6 - motor6);
        // printf("7m %lu\n", motor7 - motor6);
        // printf("m %lu\n", motor_end - motor);

        // printf("2L %lu\n", logging2 - logging);
        // printf("3L %lu\n", logging3 - logging2);
        // printf("L %lu\n", logging_end - logging);

        // printf("IN %lu\n", interrupt_end - interrupt);

        // printf("cv_all %lu\n", bdshot600_dma_get_timings()[4] - bdshot600_dma_get_timings()[0]);
        // printf("cv_all2 %lu\n", bdshot600_dma_get_timings()[2] - bdshot600_dma_get_timings()[0]);
        // printf("cv_all3 %lu\n", bdshot600_dma_get_timings()[3] - bdshot600_dma_get_timings()[2]);
        // printf("cv_all5 %lu\n", bdshot600_dma_get_timings()[4] - bdshot600_dma_get_timings()[3]);

        // printf("pre_res %lu\n", bdshot600_dma_get_timings()[6] - bdshot600_dma_get_timings()[5]);

        // printf("cv_res %lu\n", bdshot600_dma_get_timings()[14] - bdshot600_dma_get_timings()[7]);
        // printf("cv_res8 %lu\n", bdshot600_dma_get_timings()[8] - bdshot600_dma_get_timings()[7]);
        // printf("cv_res9 %lu\n", bdshot600_dma_get_timings()[9] - bdshot600_dma_get_timings()[8]);
        // printf("cv_res10 %lu\n", bdshot600_dma_get_timings()[10] - bdshot600_dma_get_timings()[9]);
        // printf("cv_res11 %lu\n", bdshot600_dma_get_timings()[11] - bdshot600_dma_get_timings()[10]);
        // printf("cv_res12 %lu\n", bdshot600_dma_get_timings()[12] - bdshot600_dma_get_timings()[11]);
        // printf("cv_res13 %lu\n", bdshot600_dma_get_timings()[13] - bdshot600_dma_get_timings()[12]);
        // printf("cv_res14 %lu\n", bdshot600_dma_get_timings()[14] - bdshot600_dma_get_timings()[13]);

        // printf("cv_resin15 %lu\n", bdshot600_dma_get_timings()[15] - bdshot600_dma_get_timings()[8]);
        // printf("cv_resin16 %lu\n", bdshot600_dma_get_timings()[16] - bdshot600_dma_get_timings()[15]);
        // printf("cv_resin17 %lu\n", bdshot600_dma_get_timings()[17] - bdshot600_dma_get_timings()[16]);

        // printf("(%lu + %lu + %lu + %lu + %lu)/100000000 = %.5f\n\n", 
        //     radio_end - radio,
        //     sensors_end - sensors,
        //     motor_end - motor,
        //     logging_end - logging,
        //     interrupt_end - interrupt,
        //     ((float)(radio_end - radio) + (sensors_end - sensors) + (motor_end - motor) + (logging_end - logging) + (interrupt_end - interrupt)) / 100000000.0
        // );

        // printf("Motor BL: %5.1f BR: %5.1f FR: %5.1f FL: %5.1f\n",
        //     motor_rpm[0],
        //     motor_rpm[1],
        //     motor_rpm[2],
        //     motor_rpm[3]
        // );

        // printf("%.1f\n",
        //     motor_rpm[0]
        // );


    }
}


uint8_t init_drivers(){
    printf("-----------------------------INITIALIZING MODULES...\n");

