Rokasbarasa1/STM32-Quadcopter/src/main.c
    uint8_t mpu6050 = init_mpu6050(
        &hi2c1, 
        ACCEL_CONFIG_RANGE_2G, 
        GYRO_CONFIG_RANGE_500_DEG, 
        LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_260HZ_ACCEL_256HZ,
        1, 
        accelerometer_scale_factor_correction, 
        accelerometer_correction, 
        gyro_correction, 
        REFRESH_RATE_HZ, 
        complementary_ratio, 
        complementary_beta
    );

    uint8_t mmc5603 = mmc5603_init(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction, 1, 200, 1);
    
    uint8_t ms5611 = init_ms5611(&hi2c1);

    uint8_t bn357 = init_bn357(&huart2, &hdma_usart2_rx, 1);
    uint8_t nrf24 = init_nrf24(&hspi1, 1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && mmc5603 && ms5611 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
        return 0;
    }

    // Initialize ms5611
    ms5611_min_pause_after_conversion_initiate_microseconds = ms5611_conversion_wait_time_microseconds();
    ms5611_set_prefered_data_conversion_preasure(MS5611_D1_CONVERSION_OSR_4096);
    ms5611_set_prefered_data_conversion_temperature(MS5611_D2_CONVERSION_OSR_4096);
 
    // Get the temperature
    ms5611_initiate_prefered_temperature_conversion();
    HAL_Delay(10); // 10ms delay to let the conversion finish
    temperature_celsius = ms5611_read_conversion_temperature_celsius();

    // Get the preasure
    ms5611_set_reference_pressure_from_number_of_samples(40);
    pressure_hpa = ms5611_read_conversion_preasure_hPa();

    // Start new preasure reading
    ms5611_initiate_prefered_preasure_conversion();
    ms5611_conversion_start_timestamp = get_absolute_time();

    // Continue initializing other peripherals
    nrf24_rx_mode(tx_address, 10);
    bn357_start_uart_interrupt();

    mpu6050_set_complementary_ratio(COMPLEMENTARY_RATIO_MULTIPLYER_OFF * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));
    mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_MAG_ONLY * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));

    return 1;
}

void handle_get_and_calculate_sensor_values(){
    // ------------------------------------------------------------------------------------------------------ Reset
    // Reset the values to make it easier to find broken sensor later
    reset_array_data(acceleration_data, 3);
    reset_array_data(gyro_angular, 3);
    reset_array_data(magnetometer_data, 3);
    got_pressure = 0;
    // temperature_celsius = 0.0f;
    // altitude_barometer = 0.0f;
    // vertical_velocity = 0.0f;

    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    // Get data from motors
    if(bdshot600_dma_convert_all_responses(1)){
        // Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
        motor_frequency[0] = low_pass_filter_pt1_read(&filter_motor_0, bdshot600_dma_get_frequency(motor_BL));
        motor_frequency[1] = low_pass_filter_pt1_read(&filter_motor_1, bdshot600_dma_get_frequency(motor_BR));
        motor_frequency[2] = low_pass_filter_pt1_read(&filter_motor_2, bdshot600_dma_get_frequency(motor_FR));
        motor_frequency[3] = low_pass_filter_pt1_read(&filter_motor_3, bdshot600_dma_get_frequency(motor_FL));
    }

    sensors2 = DWT->CYCCNT;

    // Disable interrupts as they heavily impact the i2c communication
    __disable_irq();
    // Read preasure strictly every around 10 ms
    if(get_absolute_time() - ms5611_conversion_start_timestamp > ms5611_min_pause_after_conversion_initiate_microseconds){
        if(ms5611_which_conversion == 0){
            temperature_celsius = ms5611_read_conversion_temperature_celsius();
            ms5611_initiate_prefered_preasure_conversion();
            ms5611_which_conversion = 1;
        }else if(ms5611_which_conversion == 1){
            pressure_hpa = ms5611_read_conversion_preasure_hPa();
            got_pressure = 1;

            // ONLY ONCE, set the reference after some time into the loop
            if(ms5611_reference_set == 0 && get_absolute_time() - ms5611_loop_start_timestamp > ms5611_set_reference_pressure_after_microseconds_of_loop){
                ms5611_reference_set = 1;
                altitude_barometer = ms5611_get_height_centimeters_from_reference(1, 0, 1);
            }else{
                // NORMAL call
                altitude_barometer = ms5611_get_height_centimeters_from_reference(1, 0, 0);
            }
            ms5611_initiate_prefered_temperature_conversion();
            ms5611_which_conversion = 0;
        }
        ms5611_conversion_start_timestamp = get_absolute_time();
    }
    mmc5603_magnetometer_readings_micro_teslas(magnetometer_data); // Call other sensor to let mpu6050 to rest
    sensors3 = DWT->CYCCNT;
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    sensors4 = DWT->CYCCNT;
    mpu6050_get_gyro_readings_dps(gyro_angular);
    __enable_irq();
    sensors5 = DWT->CYCCNT;

    // printf("ACCEL,%5.2f,%5.2f,%5.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
    // printf("GYRO,%5.2f,%5.2f,%5.2f;\n", gyro_angular[0], gyro_angular[1], gyro_angular[2]);
    
    // GPS stuff
    bn357_parse_data(); // Try to parse gps
    got_gps = bn357_get_status_up_to_date(1);

    if(got_gps){
        float latitude_sign = 1 * (bn357_get_latitude_direction() == 'N') + (-1) * (bn357_get_latitude_direction() == 'S'); // Possible results: 0, 1 or -1
        float longitude_sign = 1 * (bn357_get_longitude_direction() == 'E') + (-1) * (bn357_get_longitude_direction() == 'W');
        gps_latitude = bn357_get_latitude() * latitude_sign;
        gps_longitude = bn357_get_longitude() * longitude_sign;
        gps_fix_type = bn357_get_fix_type();
        gps_satalittes_count = bn357_get_satellites_quantity();
        // This is basically proportional error
        lat_distance_to_target_meters = (gps_latitude - target_latitude) * 111320.0f;
        lon_distance_to_target_meters = (gps_longitude - target_longitude) * 111320.0f * cosf(gps_latitude * M_PI_DIV_BY_180);

        if(
            lat_distance_to_target_meters > 100.0f || 
            lat_distance_to_target_meters < -100.0f || 
            lon_distance_to_target_meters > 100.0f || 
            lon_distance_to_target_meters < -100.0f
        ){
            // low_pass_filter_biquad_set_initial_values(&biquad_filter_gps_lat, lat_distance_to_target_meters);
            // low_pass_filter_biquad_set_initial_values(&biquad_filter_gps_lon, lon_distance_to_target_meters);

