Rokasbarasa1/STM32-Quadcopter/src/main.c
        // Cap the value just in case
        if(new_alpha_value < 0.0f){
            new_alpha_value = 0.0f;
        }else if(new_alpha_value > 1.0f){
            new_alpha_value = 1.0f;
        }

        mpu6050_set_complementary_ratio_yaw(new_alpha_value);
    }


    sensor_fusion_yaw(gyro_angular, magnetometer_yaw, loop_start_timestamp_microseconds, 1, imu_orientation, &gyro_yaw);

    // No need for sensor fusion, it introduces delay
    // imu_orientation[2] = magnetometer_yaw;
    
    sensors9 = DWT->CYCCNT;
    // GPS STUFF
    float yaw_rad = (imu_orientation[2] + 0.0f) * M_PI_DIV_BY_180;

    // yaw north facing is 0, east is 90, south is 180, west is 270
    // roll_effect_on_lat = sin(yaw_rad);
    // pitch_effect_on_lat = -cos(yaw_rad);
    // roll_effect_on_lon = -cos(yaw_rad);
    // pitch_effect_on_lon = -sin(yaw_rad);

    // This is just a rotation matrix in linear algebra rotate coordinates by degrees
    error_forward = lat_distance_to_target_meters * cosf(yaw_rad) + lon_distance_to_target_meters * sinf(yaw_rad);
    error_right   = -lat_distance_to_target_meters * sinf(yaw_rad) + lon_distance_to_target_meters * cosf(yaw_rad);


    // --------------------- TODO DO SOME CROSS AXIS CORRECTION (Gyro gimbal Lock/Transfer) for roll and pitch

    sensors10 = DWT->CYCCNT;
    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    // vertical_acceleration_old = old_mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation);
    // vertical_acceleration = mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation);

    // kalman_filter_predict(&altitude_and_velocity_kalman, &vertical_acceleration);
    // kalman_filter_update(&altitude_and_velocity_kalman, &altitude_barometer);

    // altitude_sensor_fusion = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    // vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];
    sensors11 = DWT->CYCCNT;

    // printf("Alt %f vel %f ", altitude_sensor_fusion, vertical_velocity);
    // printf("IMU %f %f %f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);

    // printf("Lat %f, Lon %f\n", gps_latitude, gps_longitude);
    // printf("%f;%f;%f;\n", mangetometer_yaw_original, mangetometer_yaw_low_pass, magnetometer_yaw);
}



void handle_pid_and_motor_control(){    

    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        imu_orientation[0] >  max_angle_before_motors_off || 
        imu_orientation[0] < -max_angle_before_motors_off || 
        imu_orientation[1] >  max_angle_before_motors_off || 
        imu_orientation[1] < -max_angle_before_motors_off || 
        ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 > minimum_signal_timing_seconds
    ){  


        motor_off_index++;
        motor_off_index %= REFRESH_RATE_HZ;

        if(motor_off_index == 0){
            // DEBUG Why are motors off?
            if(imu_orientation[0] >  max_angle_before_motors_off){
                printf("MO ROLL+\n");
            }
            if(imu_orientation[0] < -max_angle_before_motors_off){
                printf("MO ROLL-\n");
            }
            if(imu_orientation[1] >  max_angle_before_motors_off){
                printf("MO PITCH+\n");
            }
            if(imu_orientation[1] < -max_angle_before_motors_off){
                printf("MO PITCH-\n");
            }
            if( ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 > minimum_signal_timing_seconds){
                printf("MO RADIO\n");
            }
        }



        // When not receiving signals, increase the complementary filter ratio to quickly smooth out any movements done by carrying the drone
        mpu6050_set_complementary_ratio(COMPLEMENTARY_RATIO_MULTIPLYER_OFF * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));
        // uint64_t timm_absolute = get_absolute_time();

        // float timessss = ((float)timm_absolute - (float)last_signal_timestamp_microseconds) / 1000000.0;
        // printf("STOP %.1f %.1f - %f %f %f %f %f\n", imu_orientation[0], imu_orientation[1], timessss, (float)timm_absolute, (float)absolute_microseconds_since_start,  (float)absolute_microseconds_since_start, (float)last_signal_timestamp_microseconds);

        // printf("b\n");
        throttle_value_FR = min_dshot600_throttle_value;
        throttle_value_FL = min_dshot600_throttle_value;
        throttle_value_BL = min_dshot600_throttle_value;
        throttle_value_BR = min_dshot600_throttle_value;

        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging
        motor_power[1] = throttle_value_FL; // Logging
        motor_power[2] = throttle_value_BR; // Logging
        motor_power[3] = throttle_value_FR; // Logging

        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 0;
        remote_control[2] = 0;
        remote_control[3] = 0;

        PID_proportional[0] = 0; // Logging
        PID_proportional[1] = 0; // Logging
        PID_proportional[2] = 0; // Logging

        PID_integral[0] = 0; // Logging
        PID_integral[1] = 0; // Logging
        PID_integral[2] = 0; // Logging

        PID_derivative[0] = 0; // Logging
        PID_derivative[1] = 0; // Logging

        PID_set_points[0] = 0; // Logging
        PID_set_points[1] = 0; // Logging
        PID_set_points[2] = 0; // Logging
        PID_set_points[3] = 0; // Logging

