Rokasbarasa1/STM32-Quadcopter/src/main.c
        printf("Accel: '");
        for (size_t i = 0; i < 32; i++){
            printf("%c", rx_data[i]);
        }
        printf("'\n");

        extract_accelerometer_offsets(rx_data, strlen(rx_data), &added_x_axis_offset, &added_y_axis_offset);
        printf("Got offsets %f %f\n", -added_x_axis_offset, -added_y_axis_offset);

        accelerometer_roll_offset = base_accelerometer_roll_offset - added_x_axis_offset;
        accelerometer_pitch_offset = base_accelerometer_pitch_offset -  added_y_axis_offset;

        pid_reset_integral_sum(&angle_roll_pid);
        pid_reset_integral_sum(&angle_pitch_pid);

        calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
        printf("Calibrated gyro\n");
        // Get the initial position again
        get_initial_position();
        printf("Got initial position again\n");

        // Capture any radio messages that were sent durring the calibration proccess and discard them
        for (uint8_t i = 0; i < 50; i++){
            if(nrf24_data_available(1)){
                nrf24_receive(rx_data);
            }
        }
        printf("Got rid of old radio values\n");
        
        // Reset the sesor fusion and the pid accumulation
    }else if(strcmp(rx_type, "fm") == 0){
        printf("Got flight mode\n");

        uint8_t new_flight_mode;

        extract_flight_mode(rx_data, strlen(rx_data), &new_flight_mode);

        printf("Got new flight mode %d\n", new_flight_mode);
        flight_mode = new_flight_mode;

        set_flight_mode(flight_mode);

        find_accelerometer_error(10);

    }

    rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
}

void post_remote_control_step(){
    if(target_altitude_barometer_set == 0 && ms5611_reference_set == 1){
        target_altitude_barometer = altitude_barometer;
        target_altitude_barometer_set = 1;
    }
    // Increment the altitude hold target
    if(flight_mode == 2){


        float throttle_deadzone = apply_dead_zone(throttle, 100.0, 0.0, 10);
        
        // Was above or bellow 50.0 in throttle and now is 50.0 - Set the target again to current
        if (throttle_deadzone == 50.0 && (last_throttle_deadzone > 50.0 || last_throttle_deadzone < 50.0)){
            target_altitude_barometer = altitude_barometer;

        // Was bellow or above 50.0 and went immediately to the opposite side of throttle - Need to set the target, so then it is easy to 
        }else if((throttle_deadzone > 50.0 && last_throttle_deadzone < 50.0) || (throttle < 50.0 && last_throttle_deadzone > 50.0)){
            target_altitude_barometer = altitude_barometer;


        // If target not set again then set 
        }else{

            
            // Add a bit of rate of change dependant on the throttle and the refres rate
            float rate_of_change_addition_altitude = (((apply_dead_zone(throttle-50.0f, 50.0f, -50.0f, 5.0f))/50.0f) * altitude_barometer_rate_of_change_max_cm_s) / REFRESH_RATE_HZ;
            target_altitude_barometer += rate_of_change_addition_altitude;
    
            // printf("Alt %.2f Altitude target: %.2f added %f, th %.1f\n", altitude_barometer, target_altitude_barometer, rate_of_change_addition_altitude, throttle);
        }
        
        last_throttle_deadzone = throttle_deadzone;
    }
}

void initialize_control_abstractions(){
    // PID controllers
    acro_roll_pid = pid_init(acro_roll_pitch_master_gain * acro_roll_pitch_gain_p, acro_roll_pitch_master_gain * acro_roll_pitch_gain_i, acro_roll_pitch_master_gain * acro_roll_pitch_gain_d, 0.0, get_absolute_time(), 25, -25, 1, 0);
    acro_pitch_pid = pid_init(acro_roll_pitch_master_gain * acro_roll_pitch_gain_p, acro_roll_pitch_master_gain * acro_roll_pitch_gain_i, acro_roll_pitch_master_gain * acro_roll_pitch_gain_d, 0.0, get_absolute_time(), 25, -25, 1, 0);
    acro_yaw_pid = pid_init(acro_yaw_gain_p * acro_yaw_gain_master, acro_yaw_gain_i * acro_yaw_gain_master, 0, 0.0, get_absolute_time(), 10.0, -10.0, 1, 0);

    angle_roll_pid = pid_init(angle_roll_pitch_master_gain * angle_roll_pitch_gain_p, angle_roll_pitch_master_gain * angle_roll_pitch_gain_i, angle_roll_pitch_master_gain * angle_roll_pitch_gain_d, 0.0, get_absolute_time(), angle_mode_rate_degrees_per_second_max_integral_derivative, -angle_mode_rate_degrees_per_second_max_integral_derivative, 1, 0);
    angle_pitch_pid = pid_init(angle_roll_pitch_master_gain * angle_roll_pitch_gain_p, angle_roll_pitch_master_gain * angle_roll_pitch_gain_i, angle_roll_pitch_master_gain * angle_roll_pitch_gain_d, 0.0, get_absolute_time(), angle_mode_rate_degrees_per_second_max_integral_derivative, -angle_mode_rate_degrees_per_second_max_integral_derivative, 1, 0);

    altitude_hold_pid = pid_init(altitude_hold_master_gain * altitude_hold_gain_p, altitude_hold_master_gain * altitude_hold_gain_i, altitude_hold_master_gain * altitude_hold_gain_d, 0.0, get_absolute_time(), 10.0, -0.0, 1, 0); // Min value is 0 because motors dont go lower that that

    gps_longitude_pid = pid_init(gps_hold_master_gain * gps_hold_gain_p, gps_hold_master_gain * gps_hold_gain_i, gps_hold_master_gain * gps_hold_gain_d, 0.0, get_absolute_time(), 5.0, -5.0, 0, 0);
    gps_latitude_pid = pid_init(gps_hold_master_gain * gps_hold_gain_p, gps_hold_master_gain * gps_hold_gain_i, gps_hold_master_gain * gps_hold_gain_d, 0.0, get_absolute_time(), 5.0, -5.0, 0, 0);

    // Filtering
    filter_magnetometer_x = filtering_init_low_pass_filter_biquad(filtering_magnetometer_cutoff_frequency, REFRESH_RATE_HZ);
    filter_magnetometer_y = filtering_init_low_pass_filter_biquad(filtering_magnetometer_cutoff_frequency, REFRESH_RATE_HZ);
    filter_magnetometer_z = filtering_init_low_pass_filter_biquad(filtering_magnetometer_cutoff_frequency, REFRESH_RATE_HZ);

    // Magnetometer filtering
    iir_filter_magnetometer_x = iir_filter_init(magnetometer_iir_filter_order, magnetometer_iir_filter_feedback, magnetometer_iir_filter_feedforward);
    iir_filter_magnetometer_y = iir_filter_init(magnetometer_iir_filter_order, magnetometer_iir_filter_feedback, magnetometer_iir_filter_feedforward);
    iir_filter_magnetometer_z = iir_filter_init(magnetometer_iir_filter_order, magnetometer_iir_filter_feedback, magnetometer_iir_filter_feedforward);

    moving_average_magnetometer_x = moving_average_init(moving_average_magetometer_size);
    moving_average_magnetometer_y = moving_average_init(moving_average_magetometer_size);
    moving_average_magnetometer_z = moving_average_init(moving_average_magetometer_size);

    outlier_detection_magnetometer_x = outlier_detection_init(outlier_detection_magnetometer_window_size, outlier_detection_magnetometer_threshold);
    outlier_detection_magnetometer_y = outlier_detection_init(outlier_detection_magnetometer_window_size, outlier_detection_magnetometer_threshold);
    outlier_detection_magnetometer_z = outlier_detection_init(outlier_detection_magnetometer_window_size, outlier_detection_magnetometer_threshold);


    biquad_filter_accelerometer_x = filtering_init_low_pass_filter_biquad(filtering_accelerometer_cutoff_frequency, REFRESH_RATE_HZ);
    biquad_filter_accelerometer_y = filtering_init_low_pass_filter_biquad(filtering_accelerometer_cutoff_frequency, REFRESH_RATE_HZ);
    biquad_filter_accelerometer_z = filtering_init_low_pass_filter_biquad(filtering_accelerometer_cutoff_frequency, REFRESH_RATE_HZ);
    // Yaw filtering 
    filter_gyro_z = filtering_init_low_pass_filter_pt1(filter_gyro_z_yaw_cutoff_frequency, REFRESH_RATE_HZ);


