Rokasbarasa1/STM32-Quadcopter/src/main.c
void indicate_mistake_on_sd_card(){
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(200);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(200);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(200);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(200);
}

void indicate_sd_logging_ok(){
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    HAL_Delay(250);
}

void setup_logging_to_sd(uint8_t use_updated_file_name){
    // Initialize sd card logging
    sd_card_initialized = 0;
    if(!use_updated_file_name) sd_card_initialize_spi(&hspi3, GPIOA, GPIO_PIN_15, GPIOA, GPIO_PIN_12);
    

    // OK
    if(!sd_test_interface()){
        printf("Failed to initialize the sd card interface: Logging slave issue\n");
        indicate_mistake_on_logger();
        return;
    }

    printf("SD logging: Logger module is working\n");

    // BLACKBOX
    if(use_blackbox_logging){
        if(use_updated_file_name){
            sd_card_initialized = sd_special_initialize(new_log_file_blackbox_base_name);
        }else{
            // OK
            sd_card_initialized = sd_special_initialize(log_file_blackbox_base_name);
        }


        if(!sd_card_initialized){
            printf("Failed to initialize the sd card interface: SD card connection issue\n");
            printf("SD logging: FAILED to initialize blackbox logging. Code %d\n", sd_get_response());
            indicate_mistake_on_sd_card();
            return;
        }

        printf("SD logging: Initialized blackbox logging. Code %d\n", sd_get_response());


        // Only has to be done initially not when new files are opened after that
        if(sd_card_initialized && !use_updated_file_name){
            // Get the index of the file

            // OK
            blackbox_file_index = sd_special_get_file_index();
            printf("SD logging: File index is %d\n", blackbox_file_index);

            // Create the new file name string. Will be used for repeated log starts
            uint16_t length = snprintf(
                NULL, 
                0,
                "-%d%s", 
                blackbox_file_index,
                log_file_blackbox_base_name
            );
            
            // allocate memory for the string
            new_log_file_blackbox_base_name = (char*)malloc((length + 1) + sizeof(char)); // +1 for the null terminator

            // format the string
            snprintf(
                (char*)new_log_file_blackbox_base_name, 
                length + 1, 
                "-%d%s", 
                blackbox_file_index,
                log_file_blackbox_base_name
            );
        }

        sd_card_async = sd_special_enter_async_byte_mode(1);// Slave should reset when async stops

        if(!sd_card_async){
            printf("SD logging: failed to enter async byte mode\n");
            indicate_mistake_on_logger();
            sd_card_initialized = 0;
            return;
        }
        printf("SD logging: entered async BLACKBOX mode\n");

        uint8_t* sd_card_buffer = sd_card_get_buffer_pointer(1);
        uint16_t betaflight_header_length = 0;
        betaflight_blackbox_wrapper_get_header(
            REFRESH_RATE_HZ,
            acro_roll_pitch_gain_p * acro_roll_pitch_master_gain,
            acro_roll_pitch_gain_i * acro_roll_pitch_master_gain,
            acro_roll_pitch_gain_d * acro_roll_pitch_master_gain,
            acro_roll_pitch_gain_p * acro_roll_pitch_master_gain,
            acro_roll_pitch_gain_i * acro_roll_pitch_master_gain,
            acro_roll_pitch_gain_d * acro_roll_pitch_master_gain,
            acro_yaw_gain_p,
            acro_yaw_gain_i,
            0,
            angle_roll_pitch_gain_p * angle_roll_pitch_master_gain,
            angle_roll_pitch_gain_i * angle_roll_pitch_master_gain,
            angle_roll_pitch_gain_d * angle_roll_pitch_master_gain,
            altitude_hold_gain_p * altitude_hold_master_gain,
            altitude_hold_gain_i * altitude_hold_master_gain,
            altitude_hold_gain_d * altitude_hold_master_gain,
            gps_hold_gain_p * gps_hold_master_gain,
            gps_hold_gain_i * gps_hold_master_gain,
            gps_hold_gain_d * gps_hold_master_gain,
            filter_gyro_z_yaw_cutoff_frequency,
            25, // Integral windup
            21, // Gyro lowpass cutoff
            20, // Accelerometer lowpass cutoff
            dshot_refresh_rate,
            min_dshot600_throttle_value,
            max_dshot600_throttle_value,
            actual_min_dshot600_throttle_value,
            actual_max_dshot600_throttle_value,
            d_term_filtering_expo,
            rpm_notch_filter_q_harmonic_1,
            rpm_notch_filter_min_frequency,
            d_term_filtering_min_cutoff,
            d_term_filtering_max_cutoff,
            d_term_filtering_expo,
            &betaflight_header_length,
            sd_card_buffer,
            10000,
            blackbox_debug_mode,
            COMPLEMENTARY_RATIO_MULTIPLYER_FLIGHT
        );
        
        sd_card_buffer_increment_index_by_amount(betaflight_header_length);

        sd_special_write_chunk_of_byte_data_no_slave_response(sd_card_get_buffer_pointer(1), betaflight_header_length);

        sd_buffer_swap();
        sd_buffer_clear_index(1); // Reset the index

        HAL_Delay(1000); // wait a bit for the logger to write the data into SD
        printf("SD logging: sent blackbox header\n");

    // TXT
    }else if(!use_blackbox_logging){
        if(txt_logging_mode == 0) sd_card_initialized = sd_special_initialize(log_file_base_name);
        else if(txt_logging_mode == 1) sd_card_initialized = sd_special_initialize(log_file_base_name_gps);
        else if(txt_logging_mode == 2) sd_card_initialized = sd_special_initialize(log_file_base_name_alt);
        else if(txt_logging_mode == 3) sd_card_initialized = sd_special_initialize(log_file_base_name_mag);
        else if(txt_logging_mode == 4) sd_card_initialized = sd_special_initialize(log_file_base_name_yaw);
        else if(txt_logging_mode == 5) sd_card_initialized = sd_special_initialize(log_file_base_name_timing);
        else sd_card_initialized = sd_special_initialize(log_file_base_name);

        if(!sd_card_initialized){
            printf("SD logging: FAILED to initialize txt logging. Code %d\n", sd_get_response());
            printf("Failed to initialize the sd card interface: SD card connection issue\n");
            indicate_mistake_on_sd_card();
            return;
        }

        printf("SD logging: Initialized txt logging. Code %d\n", sd_get_response());

        sd_card_async = sd_special_enter_async_string_mode(1);

        if(!sd_card_async){
            printf("SD logging: failed to enter async TXT mode\n");
            indicate_mistake_on_logger();
            sd_card_initialized = 0;
            return;
        }

        
        sd_buffer_swap();
        sd_buffer_clear_index(1); // Reset the index

        HAL_Delay(1000); // wait a bit for the logger to write the data into SD
        
