Rokasbarasa1/STM32-Quadcopter/src/main.c
        printf("SD logging: entered async TXT mode\n");
    }
    
    indicate_sd_logging_ok();
}

void handle_pre_loop_start(){
    printf("Looping\n");

    // Capture any radio messages that were sent durring the boot proccess and discard them
    for (uint8_t i = 0; i < 50; i++){
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
        }
    }

    // Reset the timer
    __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    startup_time_microseconds = get_absolute_time();
    entered_loop = 1;

    // Timing for other functionality
    startup_time_microseconds = get_absolute_time();
    ms5611_loop_start_timestamp = get_absolute_time();
    yaw_loop_start_timestamp = get_absolute_time();
}

void handle_loop_start(){
    loop_start_microseconds = __HAL_TIM_GET_COUNTER(&htim4);
    loop_start_miliseconds = HAL_GetTick();
    loop_start_timestamp_microseconds = get_absolute_time();
}

uint64_t get_absolute_time(){
    // Get the current updated absolute timestamp
    return absolute_microseconds_since_start + __HAL_TIM_GET_COUNTER(&htim4);
}

#define MICROSECONDS_TO_HOURS (1.0f / 3600000000.0f) // The division is more efficient with multiplication
#define HOURS_TO_MICROSECONDS (3600000000.0f)

#define MICROSECONDS_TO_MINUTES (1.0f / 60000000.0f)
#define MINUTES_TO_MICROSECONDS (60000000.0f)

#define MICROSECONDS_TO_SECONDS (1.0f / 1000000.0f)
#define SECONDS_TO_MICROSECONDS (1000000.0f)

#define MICROSECONDS_TO_MILISECONDS (1.0f / 1000.0f)
#define MILISECONDS_TO_MICROSECONDS (1000.0f)


void uint64_to_str(uint64_t value, char *buf) {
    char tmp[21];
    int i = 0;
    if (value == 0) {
        buf[0] = '0';
        buf[1] = '\0';
        return;
    }
    while (value > 0) {
        tmp[i++] = '0' + (value % 10);
        value /= 10;
    }
    for (int j = 0; j < i; ++j) {
        buf[j] = tmp[i - j - 1];
    }
    buf[i] = '\0';
}

void handle_logging(){
    delta_time = get_absolute_time() - startup_time_microseconds; // Microseconds
    time_since_startup_hours =                  delta_time * MICROSECONDS_TO_HOURS;
    time_since_startup_minutes =               (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS) * MICROSECONDS_TO_MINUTES;
    time_since_startup_seconds =               (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS) * MICROSECONDS_TO_SECONDS;
    time_since_startup_ms =                    (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS - time_since_startup_seconds * SECONDS_TO_MICROSECONDS) * MICROSECONDS_TO_MILISECONDS;
    time_since_startup_microseconds =           delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS - time_since_startup_seconds * SECONDS_TO_MICROSECONDS - time_since_startup_ms * MILISECONDS_TO_MICROSECONDS;
    uint32_t time_blackbox = ((time_since_startup_hours * 60 + time_since_startup_minutes * 60) + time_since_startup_seconds) * 1000000 + time_since_startup_ms * 1000 + time_since_startup_microseconds;

    uint8_t skip_write = 0;

    if(sd_card_initialized){
        uint16_t data_size = 0;

        if(use_blackbox_logging){
            uint16_t data_size_data = 0;
            uint8_t* sd_card_buffer = (uint8_t*)sd_card_get_buffer_pointer(1);

            float angle_mode_targers[] = {angle_target_roll, angle_target_pitch};
            betaflight_blackbox_get_encoded_data_string(
                loop_iteration,
                time_blackbox,
                PID_proportional,
                PID_integral,
                PID_derivative,
                PID_feed_forward,
                remote_control,
                PID_set_points,
                gyro_angular,
                vertical_velocity,
                acceleration_data,
                motor_power,
                magnetometer_data,
                motor_frequency,
                imu_orientation,
                angle_mode_targers,
                altitude_barometer,
                &data_size_data,
                sd_card_buffer,
                blackbox_debug_mode
            );
            
            uint16_t data_size_gps = 0;
            if(got_gps){
                betaflight_blackbox_get_encoded_gps_string(
                    bn357_get_utc_time_raw(),
                    bn357_get_satellites_quantity(),
                    bn357_get_latitude_decimal_format(),
                    bn357_get_longitude_decimal_format(),
                    &data_size_gps, // it will append but not overwrite
                    sd_card_buffer + data_size_data // Offset the buffer, to not overwrite the data
                );
            }

            // printf("I %d\n", data_size_data);
            // printf("G %d\n", data_size_gps);

            data_size = data_size_data + data_size_gps;
            sd_card_buffer_increment_index_by_amount(data_size);
        }else{
            if(txt_logging_mode == 0){
                // TXT based logging
                // Log a bit of data
                // sd_card_append_to_buffer(1, "%02d:%02d:%02d:%03d;", time_since_startup_hours, time_since_startup_minutes, time_since_startup_seconds, time_since_startup_ms);
                // sd_card_append_to_buffer(1, "ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
                // sd_card_append_to_buffer(1, "GYRO,%.2f,%.2f,%.2f;", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
                // sd_card_append_to_buffer(1, "MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
                // sd_card_append_to_buffer(1, "MOTOR,1=%.2f,2=%.2f,3=%.2f,4=%.2f;", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
                // sd_card_append_to_buffer(1, "ERROR,pitch=%.2f,roll=%.2f,yaw=%.2f,altitude=%.2f;", error_angle_pitch, error_angle_roll, error_acro_yaw, error_altitude);
                // sd_card_append_to_buffer(1, "TEMP,%.2f;", temperature_celsius);
                // sd_card_append_to_buffer(1, "ALT %.2f;", altitude_sensor_fusion);
                // sd_card_append_to_buffer(1, "GPS,lon-%f,lat-%f;", bn357_get_longitude_decimal_format(), bn357_get_latitude_decimal_format());
                // sd_card_append_to_buffer(1, "\n");

