Rokasbarasa1/STM32-Quadcopter/src/main.c
                // sd_card_append_to_buffer(1, "%6.5f %6.5f %6.5f", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);  
                // sd_card_append_to_buffer(1, "\n");
                
            }else if(txt_logging_mode == 1){ // Log gps target and current position
                if(got_gps){
                    // printf("s %f\n",gps_hold_roll_adjustment);
                    // target lat, target lon, lat, lon, roll_adjust, pitch_adjust, roll, pitch, yaw, sats, roll_effect_on_lat, pitch_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lon, error_lat, error_lon
                    if(gps_target_unset_logged == 0){
                        if(gps_target_unset_cause == 1){
                            sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;r%.3f;\n", 
                            // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;r%.3f;\n", 
                                target_latitude * 1000000.0f,            // %f;
                                target_longitude * 1000000.0f,           // %f;
                                gps_latitude * 1000000.0f,               // %f;
                                gps_longitude * 1000000.0f,              // %f;
                                gps_satalittes_count,       // %d;
                                imu_orientation[2],         // %.1f;
                                gps_hold_roll_adjustment,   // %.1f;
                                gps_hold_pitch_adjustment,  // %.1f;
                                imu_orientation[0],         // %.1f;
                                imu_orientation[1],         // %.1f;
                                gps_target_unset_roll_value
                            );
                        }else if(gps_target_unset_cause == 0){
                            sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;p%.3f;\n", 
                            // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;p%.3f;\n", 
                                target_latitude * 1000000.0f,            // %f;
                                target_longitude * 1000000.0f,           // %f;
                                gps_latitude * 1000000.0f,               // %f;
                                gps_longitude * 1000000.0f,              // %f;
                                gps_satalittes_count,       // %d;
                                imu_orientation[2],         // %.1f;
                                gps_hold_roll_adjustment,   // %.1f;
                                gps_hold_pitch_adjustment,  // %.1f;
                                imu_orientation[0],         // %.1f;
                                imu_orientation[1],         // %.1f;
                                gps_target_unset_pitch_value
                            );
                        }else if(gps_target_unset_cause == 3){
                            sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;gps_can_be_used;\n", 
                            // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;radoffgot;\n", 
                                target_latitude * 1000000.0f,            // %f;
                                target_longitude * 1000000.0f,           // %f;
                                gps_latitude * 1000000.0f,               // %f;
                                gps_longitude * 1000000.0f,              // %f;
                                gps_satalittes_count,       // %d;
                                imu_orientation[2],         // %.1f;
                                gps_hold_roll_adjustment,   // %.1f;
                                gps_hold_pitch_adjustment,  // %.1f;
                                imu_orientation[0],         // %.1f;
                                imu_orientation[1]          // %.1f;
                            );
                        }else if(gps_target_unset_cause == 4){
                            sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;gps_position_hold_enabled;\n", 
                            // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;radoffgot;\n", 
                                target_latitude * 1000000.0f,            // %f;
                                target_longitude * 1000000.0f,           // %f;
                                gps_latitude * 1000000.0f,               // %f;
                                gps_longitude * 1000000.0f,              // %f;
                                gps_satalittes_count,       // %d;
                                imu_orientation[2],         // %.1f;
                                gps_hold_roll_adjustment,   // %.1f;
                                gps_hold_pitch_adjustment,  // %.1f;
                                imu_orientation[0],         // %.1f;
                                imu_orientation[1]          // %.1f;
                            );
                        }else if(gps_target_unset_cause == 2){
                            if(got_gps){
                                sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;radoffgot;\n", 
                                // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;radoffgot;\n", 
                                    target_latitude * 1000000.0f,            // %f;
                                    target_longitude * 1000000.0f,           // %f;
                                    gps_latitude * 1000000.0f,               // %f;
                                    gps_longitude * 1000000.0f,              // %f;
                                    gps_satalittes_count,       // %d;
                                    imu_orientation[2],         // %.1f;
                                    gps_hold_roll_adjustment,   // %.1f;
                                    gps_hold_pitch_adjustment,  // %.1f;
                                    imu_orientation[0],         // %.1f;
                                    imu_orientation[1]          // %.1f;
                                );
                            }else{
                                sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;radoff;\n", 
                                // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;radoff;\n", 
                                    target_latitude * 1000000.0f,            // %f;
                                    target_longitude * 1000000.0f,           // %f;
                                    gps_latitude * 1000000.0f,               // %f;
                                    gps_longitude * 1000000.0f,              // %f;
                                    gps_satalittes_count,       // %d;
                                    imu_orientation[2],         // %.1f;
                                    gps_hold_roll_adjustment,   // %.1f;
                                    gps_hold_pitch_adjustment,  // %.1f;
                                    imu_orientation[0],         // %.1f;
                                    imu_orientation[1]          // %.1f;
                                );
                            }
                        }
                        
                        gps_target_unset_logged = 1;
                    }else{
                        sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;%f;%f;\n", 
                        // sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.2f;%.2f;%.2f;%.2f;%.1f;%.1f;%.1f;%.1f;\n", 
                            target_latitude * 1000000.0f,            // %f;
                            target_longitude * 1000000.0f,           // %f;
                            gps_latitude * 1000000.0f,               // %f;
                            gps_longitude * 1000000.0f,              // %f;
                            gps_satalittes_count,       // %d;
                            imu_orientation[2],         // %.1f;
                            gps_hold_roll_adjustment,   // %.1f;
                            gps_hold_pitch_adjustment,  // %.1f;
                            imu_orientation[0],         // %.1f;
                            imu_orientation[1],          // %.1f;
                            lat_distance_to_target_meters,
                            lon_distance_to_target_meters
                        );
                    }

                    
                }else{
                    sd_card_append_to_buffer(1, "NAN\n");
                }
            }else if(txt_logging_mode == 2){
                if(got_pressure == 1){
                    if(ms5611_reference_set == 1){
                        // alt_barometer, target_alt, throttle_actual, throttle , outer P, outer I, outer D, inner PID, inner P, inner I, inner D
                        sd_card_append_to_buffer(1, "%.2f;%.2f;%.1f;%.1f;%.2f;%.2f;%.2f;\n", 
                            altitude_barometer,
                            target_altitude_barometer,
                            throttle_value,
                            throttle,
                            PID_proportional[3],
                            PID_integral[3],
                            PID_derivative[3]
                        );
                    }else if(ms5611_reference_set == 0){
                        // IF reference not set then dont log the data
                        sd_card_append_to_buffer(1, "0.0;0.0;0.0;0.0;0.0;0.0;0.0;\n");
                    }
                }else{
                    skip_write = 1;
                }
            }else if (txt_logging_mode == 3){
                float raw_magnetometer_data[3] = {0};
                mmc5603_previous_raw_magetometer_readings(raw_magnetometer_data);

