Rokasbarasa1/STM32-Quadcopter/src/main.c
                sd_card_append_to_buffer(1, "%f\t%f\t%f\t\n", 
                    raw_magnetometer_data[0],
                    raw_magnetometer_data[1],
                    raw_magnetometer_data[2]
                );
            }else if (txt_logging_mode == 4){
                char abs_time_str[21];
                uint64_to_str(get_absolute_time(), abs_time_str);
                sd_card_append_to_buffer(1, "%s;%f;%f;%f;%f;%f;%f;%f;\n",
                    abs_time_str,
                    mangetometer_yaw_original,
                    mangetometer_yaw_low_pass,
                    magnetometer_yaw,
                    imu_orientation[2],
                    gyro_yaw,
                    imu_orientation[0],
                    imu_orientation[1]
                );
            }else if (txt_logging_mode == 5){

                char abs_time_str[21];
                uint64_to_str(delta_time_total_loop_time_previous_loop_microseconds, abs_time_str);

                char delta_loop_time_str[21];
                uint64_to_str(delta_time_without_waiting_from_previous_loop_microseconds, delta_loop_time_str);
                sd_card_append_to_buffer(1, "%s;%s;\n",
                    abs_time_str,
                    delta_loop_time_str
                );
            }
        }

        // Be sure that the write still happens at least once per second
        if(skip_write) return;

        if(sd_card_async){
            if(use_simple_async){
                sd_special_write_chunk_of_string_data_no_slave_response(sd_card_get_buffer_pointer(1));
                sd_buffer_clear(1);
            }else{
                if(use_blackbox_logging){
                    logging2 = DWT->CYCCNT;
                    
                    // uint8_t * buffer_new = (uint8_t *)sd_card_get_buffer_pointer(1);
                    // printf("%d write  ", data_size);
                    // for (uint16_t i = 0; i < data_size; i++){
                    //     printf("%02X ", buffer_new[i]);
                    // }
                    // printf("\n");

                    sd_special_write_chunk_of_byte_data_async(sd_card_get_buffer_pointer(1), data_size);

                    sd_buffer_swap();
                    sd_buffer_clear_index(1); // Reset the index
                    // sd_buffer_clear(1); // Dont need to wipe all of it for now

                    logging3 = DWT->CYCCNT;
                }else{
                    
                    // uint8_t* sd_card_buffer = (uint8_t*)sd_card_get_buffer_pointer(1);
                    // printf("%d write:'", strlen(sd_card_buffer));
                    // for (uint16_t i = 0; i < strlen(sd_card_buffer); i++){
                    //     printf("%c", sd_card_buffer[i]);
                    // }
                    // printf("'\n");

                    sd_special_write_chunk_of_string_data_async(sd_card_get_buffer_pointer(1));
                    sd_buffer_swap();
                    sd_buffer_clear_index(1); // Reset the index
                    // sd_buffer_clear(1); // Dont need to wipe all of it for now
                }
            }
        }else{
            if(use_blackbox_logging){
                sd_card_initialized = sd_special_write_chunk_of_byte_data(sd_card_get_buffer_pointer(1), data_size);
            }else{
                sd_card_initialized = sd_special_write_chunk_of_string_data(sd_card_get_buffer_pointer(1));
            }
        }
    }

    // printf("Motor BL: %5.1f BR: %5.1f FR: %5.1f FL: %5.1f \n",
    //     motor_frequency[0],
    //     motor_frequency[1],
    //     motor_frequency[2],
    //     motor_frequency[3]
    // );

    // printf("%5.1f\n",
    //     motor_frequency[0]
    // );

    // printf("ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
    // printf("GYRO,%5.2f,%5.2f,%5.2f;", gyro_angular[0], gyro_angular[1], gyro_angular[2]);
    // printf("MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
    // printf("TEMP,%.2f;", temperature_celsius);
    // printf("ALT %.2f;", altitude_barometer);
    // printf("\n");

    // Update the blue led with current sd state
    // GPS stuff more imortant curently so this is disabled
    // if(sd_card_initialized){
    //     HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    // }else{
    //     HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    // }
}


void handle_loop_end(){

    delta_time_without_waiting_from_previous_loop_microseconds = get_absolute_time() - loop_start_timestamp_microseconds;

    loop_iteration++;

    // printf("b%.1f\n", (float)(__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds)/1000.0);
    // printf("%.1f\n", (float)(__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds)/1000.0);
    // printf("%.2f\n", (float)(__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds)/1000.0);

    // If the delta is less than the target keep looping
    while (precalculated_timing_miliseconds > (__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds));

    // Get the final count and add it to the total microsecond
    // If the timer overflew use the ticks instead

    // Right now this HAL_GetTick method is broken as the HAL_GetTick returns a totaly innacurate value
    // TICK 1961427072.000000 = 1762787968.000000 + ((228252.000000 - 29613.000000) * 1000)

    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_UPDATE)){
        // float temp_absl = (float)absolute_microseconds_since_start;
        absolute_microseconds_since_start = absolute_microseconds_since_start + 65536;
        // printf("TICK %f = %f + 65536\n", (float)absolute_microseconds_since_start, temp_absl);
        
        // The bellow is currently not working.

        // absolute_microseconds_since_start = absolute_microseconds_since_start + ((HAL_GetTick() - loop_start_miliseconds) * 1000);
        // printf("TICK %f = %f + ((%f - %f) * 1000)\n", (float)absolute_microseconds_since_start, temp_absl, (float)HAL_GetTick(), (float)loop_start_miliseconds);
        // printf("a%lu\n", HAL_GetTick() - loop_start_miliseconds);

    }else{
        //
        // float temp_absl = (float)absolute_microseconds_since_start;
        absolute_microseconds_since_start = absolute_microseconds_since_start + (__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds);
        // printf("NORM %f = %f + (%f - %f)\n", (float)absolute_microseconds_since_start, temp_absl, (float)__HAL_TIM_GET_COUNTER(&htim4), (float)loop_start_microseconds);
        // printf("a%.1f\n", (float)(__HAL_TIM_GET_COUNTER(&htim4) - loop_start_microseconds)/1000.0);
    }

    // Reset the counter
    __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    // printf("end %lu\n", absolute_microseconds_since_start);

    delta_time_total_loop_time_previous_loop_microseconds = get_absolute_time() - loop_start_timestamp_microseconds;
}

void initialize_motor_communication(){
    // The dma streams cannot be conflicting with other peripherals

    motor_FL = bdshot600_dma_add_motor(GPIOA, GPIO_PIN_1,  TIM2, TIM_CHANNEL_2, DMA1_Stream6, DMA_CHANNEL_3);
    motor_FR = bdshot600_dma_add_motor(GPIOB, GPIO_PIN_10, TIM2, TIM_CHANNEL_3, DMA1_Stream1, DMA_CHANNEL_3);
    motor_BL = bdshot600_dma_add_motor(GPIOA, GPIO_PIN_8,  TIM1, TIM_CHANNEL_1, DMA2_Stream1, DMA_CHANNEL_6);
    motor_BR = bdshot600_dma_add_motor(GPIOA, GPIO_PIN_11, TIM1, TIM_CHANNEL_4, DMA2_Stream4, DMA_CHANNEL_6);
    bdshot600_dma_set_rotor_poles_amount(motor_rotor_poles);
    bdshot600_dma_set_motor_timeout(50); // After 50 ms of no setting of throttle, the motor will stop, for safety
    bdshot600_dma_optimize_motor_calls();


