Rokasbarasa1/STM32-Quadcopter/src/main.c
    return return_value * half_range + mid_point; // scale back to original range
}

uint8_t is_in_dead_zone(float value, float max_value, float min_value, float dead_zone) {
    float mid_point = (max_value + min_value) / 2;
    float half_range = (max_value - min_value) / 2;
    float normalized_value = (value - mid_point) / half_range; // this will be -1 at min_value, +1 at max_value

    float dead_zone_normalized = dead_zone / half_range;

    // Check if the value is within the dead zone
    if (normalized_value >= -dead_zone_normalized && normalized_value <= dead_zone_normalized) {
        return 1;
    } else {
        return 0;
    }
}

// Switch to transmit mode and send out a the base pid values to the remote
void send_pid_base_info_to_remote(){
    nrf24_tx_mode(tx_address, 10);
    // Delay a bit to avoid problem
    HAL_Delay(30);

    // Make a slash separated value
    char *string = generate_message_pid_values_nrf24(
        BASE_ANGLE_roll_pitch_GAIN_P, 
        BASE_ANGLE_roll_pitch_GAIN_I, 
        BASE_ANGLE_roll_pitch_GAIN_D,
        BASE_ANGLE_roll_pitch_MASTER_GAIN
    );
    

    // The remote always receives data as a gibberish with corrupted characters. Sending many of them will mean the remote can reconstruct the message
    // And no crc check did not work, i tried.
    for (size_t i = 0; i < 100; i++)
    {
        if(!nrf24_transmit(string)){
            printf("FAILED\n"); // Very djank
        }
    }
    free(string);
    
    // Switch back to receiver mode
    nrf24_rx_mode(tx_address, 10);
}

// Switch to transmit mode and send out a the added  pid values to the remote
void send_pid_added_info_to_remote(){
    nrf24_tx_mode(tx_address, 10);
    // Delay a bit to avoid problem
    HAL_Delay(30);

    // Make a slash separated value
    char *string = generate_message_pid_values_nrf24(
        added_angle_roll_pitch_gain_p, 
        added_angle_roll_pitch_gain_i, 
        added_angle_roll_pitch_gain_d,
        added_angle_roll_pitch_master_gain
    );
    
    // The remote always receives data as a gibberish with corrupted characters. Sending many of them will mean the remote can reconstruct the message
    // And no crc check did not work, i tried.
    for (size_t i = 0; i < 200; i++)
    {
        if(!nrf24_transmit(string)){
            printf("FAILED\n"); // Very djank
        }
    }
    free(string);
    
    // Switch back to receiver mode
    nrf24_rx_mode(tx_address, 10);
}

char* generate_message_pid_values_nrf24(float base_proportional, float base_integral, float base_derivative, float base_master){
    // calculate the length of the resulting string

    // the s is there for reasons... I just ran out of space on the 32 byte buffer for sending. It was originally supposed to be a full name
    int length = snprintf(
        NULL, 
        0,
        "/s/%.2f/%.2f/%.2f/%.2f/  ", 
        base_proportional, 
        base_integral, 
        base_derivative, 
        base_master
    );
    
    // allocate memory for the string
    char *string = malloc(length + 1); // +1 for the null terminator

    // format the string
    snprintf(
        (char*)string, 
        length + 1, 
        "/s/%.2f/%.2f/%.2f/%.2f/  ", 
        base_proportional, 
        base_integral, 
        base_derivative, 
        base_master
    );

    return string;
}

void reset_array_data(float *array, uint8_t array_size){
    memset(array, 0, array_size * sizeof(float));

}

void switch_x_and_y_axis(float *data){
    float temp = 0.0;
    temp = data[0];
    // y is x
    data[0] = data[1];
    // x is -y
    data[1] = temp;
}

void invert_axies(float *data){
    // This effectively turns the sensor around 180 degrees
    data[0] = -data[0];
    data[1] = -data[1];
}

float sawtooth_sin(float x_radian){
    return 2.0f * (x_radian*M_DIVIDE_BY_PI - floorf(x_radian*M_DIVIDE_BY_PI + 0.5f));
}

float sawtooth_cos(float x_radian){
    return 2.0f * ((x_radian + M_HALF_PI)*M_DIVIDE_BY_PI - floorf(x_radian*M_DIVIDE_BY_PI + 0.5f));
}

float triangle_wave(float x) {
    // Normalize x to be within the range [0, 2*PI)
    x = fmodf(x, M_PI_2);
    
    // Scale the normalized x to the range [0, 4]
    float scaled_x = x  * M_DIVIDE_BY_HALF_PI;
    
    // Triangle wave calculation
    if (scaled_x < 1.0f) return scaled_x;
    else if (scaled_x < 3.0f) return 2.0f - scaled_x;
    else return scaled_x - 4.0f;
}

float triangle_sin(float x){
    return triangle_wave(x);
}

float triangle_cos(float x){
    return triangle_wave(x + M_HALF_PI);
}

float map_value_to_expo_range(float value, float min_expo, float max_expo, uint8_t expo_curve){
    // Assuming value is from 0 to 100
    // Will divide value by 100 to get a value from 0 to 1
    return min_expo + powf(value* 0.01, expo_curve) * (max_expo - min_expo);
}

float map_value_to_expo_range_inverted(float value, float min_expo, float max_expo, uint8_t expo_curve){
    // Assuming value is from 0 to 100
    // Will divide value by 100 to get a value from 0 to 1
    // Some extra logic in needed to invert it.
    return min_expo + (1.0f - powf(1.0f - (value* 0.01), expo_curve)) * (max_expo - min_expo);
}















/* Auto generated shit again-----------------------------------------------*/

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 13;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

